In [2]:
#from pymongo import MongoClient
#import pandas as pd
#from json import loads
#
#df1 = pd.read_csv('business1.csv')
#
#
#records = list(loads(df1.T.to_json()).values())
#
#client = MongoClient('mongodb+srv://vinodkumar:12345@cluster0.eu4s4z9.mongodb.net/?retryWrites=true&w=majority')
#
#database_name = client['Flight_price']
#
#collection = database_name['business']
#
#collection.insert_many(records)

In [3]:
#df2 = pd.read_csv('economy1.csv')
#
#
#records = list(loads(df1.T.to_json()).values())
#
#client = MongoClient('mongodb+srv://vinodkumar:12345@cluster0.eu4s4z9.mongodb.net/?retryWrites=true&w=majority')
#
#database_name = client['Flight_price']
#
#collection = database_name['economy']
#
#collection.insert_many(records)

In [1]:
from pymongo import MongoClient
import pandas as pd
from json import loads
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

client = MongoClient('mongodb+srv://vinodkumar:12345@cluster0.eu4s4z9.mongodb.net/?retryWrites=true&w=majority')
db = client['Flight_price']
collection_1 = db['economy']
collection_2 = db['business']

df1 = pd.DataFrame(list(collection_1.find()))
df2 = pd.DataFrame(list(collection_2.find()))

df1.head()

,_id,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,63d674896d863e2985899320,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,63d674896d863e2985899321,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,63d674896d863e2985899322,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,20:45,Mumbai,"42,220"
3,63d674896d863e2985899323,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,23:55,Mumbai,"44,450"
4,63d674896d863e2985899324,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,23:55,Mumbai,"46,690"

In [2]:
df2.head()

,_id,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,63d673e36d863e29858825f0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,63d673e36d863e29858825f1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,63d673e36d863e29858825f2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,20:45,Mumbai,"42,220"
3,63d673e36d863e29858825f3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,23:55,Mumbai,"44,450"
4,63d673e36d863e29858825f4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,23:55,Mumbai,"46,690"

In [3]:
df1.shape , df2.shape

((93487, 12), (93487, 12))

In [4]:
df1.drop(columns = ['_id'], inplace=True)
df2.drop(columns = ['_id'], inplace=True)

In [5]:
df1.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"

In [6]:
df1['class_type'] = 'business'
df2['class_type'] = 'economy'

In [7]:
df1.head(3)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",business
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",business
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,20:45,Mumbai,"42,220",business

In [8]:
final = pd.merge(df1, df2, how='outer')
final.sample(5)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type
7868,15-03-2022,Air India,AI,678,09:00,Delhi,09h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,18:30,Bangalore,"42,457",business
35063,15-02-2022,Vistara,UK,970,08:45,Mumbai,07h 35m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,16:20,Chennai,"82,877",business
86077,20-03-2022,Vistara,UK,834,17:10,Chennai,14h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,07:55,Mumbai,"90,960",business
144219,07-03-2022,Vistara,UK,850,19:55,Bangalore,11h 55m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,07:50,Hyderabad,"37,985",economy
83657,31-03-2022,Vistara,UK,822,09:45,Chennai,08h 20m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,18:05,Delhi,"57,920",business

In [9]:
final.shape

(186974, 12)

In [10]:
final.isnull().sum()

date          0
airline       0
ch_code       0
num_code      0
dep_time      0
from          0
time_taken    0
stop          0
arr_time      0
to            0
price         0
class_type    0
dtype: int64

In [11]:
final.dropna(inplace=True, axis=0)
final.shape

(186974, 12)

In [12]:
final.head(4)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",business
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",business
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,20:45,Mumbai,"42,220",business
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t,23:55,Mumbai,"44,450",business

In [13]:
final.shape

(186974, 12)

In [14]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186974 entries, 0 to 186973
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        186974 non-null  object
 1   airline     186974 non-null  object
 2   ch_code     186974 non-null  object
 3   num_code    186974 non-null  int64
 4   dep_time    186974 non-null  object
 5   from        186974 non-null  object
 6   time_taken  186974 non-null  object
 7   stop        186974 non-null  object
 8   arr_time    186974 non-null  object
 9   to          186974 non-null  object
 10  price       186974 non-null  object
 11  class_type  186974 non-null  object
dtypes: int64(1), object(11)
memory usage: 18.5+ MB

In [15]:
final['date'] = pd.to_datetime(final['date'], format='%d-%m-%Y')
final.dtypes

date          datetime64[ns]
airline               object
ch_code               object
num_code               int64
dep_time              object
from                  object
time_taken            object
stop                  object
arr_time              object
to                    object
price                 object
class_type            object
dtype: object

In [16]:
final.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type
0,2022-02-11,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",business
1,2022-02-11,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",business

In [17]:
df = final.copy()
df.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type
0,2022-02-11,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612",business
1,2022-02-11,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612",business

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186974 entries, 0 to 186973
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        186974 non-null  datetime64[ns]
 1   airline     186974 non-null  object
 2   ch_code     186974 non-null  object
 3   num_code    186974 non-null  int64
 4   dep_time    186974 non-null  object
 5   from        186974 non-null  object
 6   time_taken  186974 non-null  object
 7   stop        186974 non-null  object
 8   arr_time    186974 non-null  object
 9   to          186974 non-null  object
 10  price       186974 non-null  object
 11  class_type  186974 non-null  object
dtypes: datetime64[ns](1), int64(1), object(10)
memory usage: 18.5+ MB

In [19]:
df['stop'] = df.stop.str.strip()
df.stop.value_counts()

1-stop                                             162978
non-stop                                            16204
2+-stop                                              2166
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IDR              1620
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXU              1552
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia PAT               514
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Patna             484
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia BBI               304
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia STV               186
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXE               172
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Bhubaneswar       150
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Hyderabad         142
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Delhi             118
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Raipur             86
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Chennai            84
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Guwahati           58
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia VTZ                34
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia NDC                28
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Kolkata            28
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia RPR                26
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Lucknow            20
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia GAU                 6
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia GAY                 6
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Surat               6
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia HYD                 2
Name: stop, dtype: int64

In [20]:
df.stop = df["stop"].map({"non-stop":0,"1-stop":1,"2+-stop":2})
df.stop.value_counts()

1.0    162978
0.0     16204
2.0      2166
Name: stop, dtype: int64

In [22]:
df.isnull().sum()

date             0
airline          0
ch_code          0
num_code         0
dep_time         0
from             0
time_taken       0
stop          5626
arr_time         0
to               0
price            0
class_type       0
dtype: int64

In [23]:
df.dropna(axis=0, inplace=True)
df.isnull().sum()

date          0
airline       0
ch_code       0
num_code      0
dep_time      0
from          0
time_taken    0
stop          0
arr_time      0
to            0
price         0
class_type    0
dtype: int64

In [25]:
df.shape

(181348, 12)

In [27]:
df.stop = df.stop.astype(int)
df.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type
0,2022-02-11,Air India,AI,868,18:00,Delhi,02h 00m,0,20:00,Mumbai,"25,612",business
1,2022-02-11,Air India,AI,624,19:00,Delhi,02h 15m,0,21:15,Mumbai,"25,612",business

In [30]:
df.dtypes

date          datetime64[ns]
airline               object
ch_code               object
num_code               int64
dep_time              object
from                  object
time_taken            object
stop                   int32
arr_time              object
to                    object
price                 object
class_type            object
dtype: object

In [35]:
df['dept_hour'] = df.dep_time.str.split(":").str[0]
df['dept_minute'] = df.dep_time.str.split(":").str[1]
df.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type,dept_hour,dept_minute
0,2022-02-11,Air India,AI,868,18:00,Delhi,02h 00m,0,20:00,Mumbai,"25,612",business,18,00
1,2022-02-11,Air India,AI,624,19:00,Delhi,02h 15m,0,21:15,Mumbai,"25,612",business,19,00

In [36]:
df['arr_hour'] = df.arr_time.str.split(":").str[0]
df['arr_minute'] = df.arr_time.str.split(":").str[1]
df.head(2)

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price,class_type,dept_hour,dept_minute,arr_hour,arr_minute
0,2022-02-11,Air India,AI,868,18:00,Delhi,02h 00m,0,20:00,Mumbai,"25,612",business,18,00,20,00
1,2022-02-11,Air India,AI,624,19:00,Delhi,02h 15m,0,21:15,Mumbai,"25,612",business,19,00,21,15

In [37]:
df.drop(columns=['arr_time','dep_time'], inplace=True)
df.head(2)

,date,airline,ch_code,num_code,from,time_taken,stop,to,price,class_type,dept_hour,dept_minute,arr_hour,arr_minute
0,2022-02-11,Air India,AI,868,Delhi,02h 00m,0,Mumbai,"25,612",business,18,00,20,00
1,2022-02-11,Air India,AI,624,Delhi,02h 15m,0,Mumbai,"25,612",business,19,00,21,15

In [43]:
df['journy_hour'] = df.time_taken.str.split("h").str[0]
df.head(2)

,date,airline,ch_code,num_code,from,time_taken,stop,to,price,class_type,dept_hour,dept_minute,arr_hour,arr_minute,journy_hour
0,2022-02-11,Air India,AI,868,Delhi,02h 00m,0,Mumbai,"25,612",business,18,00,20,00,02
1,2022-02-11,Air India,AI,624,Delhi,02h 15m,0,Mumbai,"25,612",business,19,00,21,15,02

In [44]:
df.drop(columns=['time_taken'], inplace=True)
df.head(2)

,date,airline,ch_code,num_code,from,stop,to,price,class_type,dept_hour,dept_minute,arr_hour,arr_minute,journy_hour
0,2022-02-11,Air India,AI,868,Delhi,0,Mumbai,"25,612",business,18,00,20,00,02
1,2022-02-11,Air India,AI,624,Delhi,0,Mumbai,"25,612",business,19,00,21,15,02

In [50]:
df['from'].value_counts()

Mumbai       37110
Delhi        35046
Bangalore    32508
Kolkata      25950
Hyderabad    25676
Chennai      25058
Name: from, dtype: int64

In [51]:
df.rename(columns = {"from":"source_city", "stop":"total_stops", "to":"destination_city"}, inplace=True)
df.head(2)

,date,airline,ch_code,num_code,source_city,total_stops,destination_city,price,class_type,dept_hour,dept_minute,arr_hour,arr_minute,journy_hour
0,2022-02-11,Air India,AI,868,Delhi,0,Mumbai,"25,612",business,18,00,20,00,02
1,2022-02-11,Air India,AI,624,Delhi,0,Mumbai,"25,612",business,19,00,21,15,02